AhmadPaykli/PIC18-Bare-Metal/MCAL_Layer/Interrupt/mcal_interrupt_config.h
/* 
 * File:   mcal_interrupt_config.h
 * Author: Ahmad Paykli
 *
 * Created on February 1, 2026, 12:54 PM
 */

#ifndef MCAL_INTERRUPT_CONFIG_H
#define	MCAL_INTERRUPT_CONFIG_H

/* ----------------- Includes -----------------*/
#include "../../pic/include/proc/pic18f4620.h"
#include "../mcal_std_types.h"
#include "../GPIO/hal_gpio.h"
#include "mcal_interrupt_gen_cfg.h"

/* ----------------- Macro Declarations -----------------*/
#define INTERRUPT_ENABLE  1
#define INTERRUPT_DISABLE 0

#define INTERRUPT_OCCUR     1
#define INTERRUPT_NOT_OCCUR 0

#define INTERRUPT_PRIORITY_ENABLE  1
#define INTERRUPT_PRIORITY_DISABLE 0


/* ----------------- Macro Functions Declarations -----------------*/
#if INTERRUPT_PRIORITY_LEVELS_ENABLE==INTERRUPT_FEATURE_ENABLE
/* this macro will enable priority levels on interrupts */
#define INTERRUPT_PriorityLevelsEnable() (RCONbits.IPEN = 1)

/* this macro will disable priority levels on interrupts */
#define INTERRUPT_PriorityLevelsDisable() (RCONbits.IPEN = 0)

/* this macro will enable high priority global interrupts */
#define INTERRUPT_GlobalInterruptHighEnable() (INTCONbits.GIEH = 1)

/* this macro will disable high priority global interrupts */
#define INTERRUPT_GlobalInterruptHighDisable() (INTCONbits.GIEH = 0)

/* this macro will enable low priority global interrupts */
#define INTERRUPT_GlobalInterruptLowEnable() (INTCONbits.GIEL = 1)

/* this macro will disable low priority global interrupts */
#define INTERRUPT_GlobalInterruptLowDisable() (INTCONbits.GIEL = 0)
#else
/* this macro will enable global interrupts */
#define INTERRUPT_GlobalInterruptEnable() (INTCONbits.GIE = 1)

/* this macro will disable global interrupts */
#define INTERRUPT_GlobalInterruptDisable() (INTCONbits.GIE = 0)

/* this macro will enable peripheral interrupts */
#define INTERRUPT_PeripheralInterruptEnable() (INTCONbits.PEIE = 1)

/* this macro will disable peripheral interrupts */
#define INTERRUPT_PeripheralInterruptDisable() (INTCONbits.PEIE = 0)
#endif

/* ----------------- Data Type Declarations -----------------*/
typedef enum{
    INTERRUPT_LOW_PRIORITY = 0,
    INTERRUPT_HIGH_PRIORITY
}interrupt_priority_cfg;

/* ----------------- Software Interfaces Declarations -----------------*/

#endif	/* MCAL_INTERRUPT_CONFIG_H */

